* Input

Avec les instructions en détail.

#+BEGIN_SRC asm
  #ip 3 ; instruction pointer is 3
  00 addi 3 16 3    ; set ip to 16
  01 seti 1 3 2     ; reg2 = 1
  02 seti 1 0 5     ; reg5 = 1
  03 mulr 2 5 1     ; reg1 = reg2 * reg5
  04 eqrr 1 4 1     ; reg1 = (reg1 == reg4)
  05 addr 1 3 3     ; ip += reg1
  06 addi 3 1 3     ; ip += 1
  07 addr 2 0 0     ; reg0 += reg2
  08 addi 5 1 5     ; reg5 += 1
  09 gtrr 5 4 1     ; reg1 = (reg5 > reg4)
  10 addr 3 1 3     ; ip += reg1
  11 seti 2 2 3     ; ip = 2
  12 addi 2 1 2     ; reg2 += 1
  13 gtrr 2 4 1     ; reg1 = (reg2 > reg4)
  14 addr 1 3 3     ; ip += reg1
  15 seti 1 1 3     ; ip = 1
  16 mulr 3 3 3     ; ip **= 2 (ip -> 256) => out
  17 addi 4 2 4     ; reg4 += 2
  18 mulr 4 4 4     ; reg4 **= 2
  19 mulr 3 4 4     ; reg4 *= ip(19)
  20 muli 4 11 4    ; reg4 *= 11
  21 addi 1 4 1     ; reg1 += 4
  22 mulr 1 3 1     ; reg1 *= ip(22)
  23 addi 1 2 1     ; reg1 += 2
  24 addr 4 1 4     ; reg4 += reg1
  25 addr 3 0 3     ; ip += reg0
  26 seti 0 2 3     ; ip = 0
  27 setr 3 6 1     ; reg1 = ip(27)
  28 mulr 1 3 1     ; reg1 *= ip(28)
  29 addr 3 1 1     ; reg1 += ip(29)
  30 mulr 3 1 1     ; reg1 *= ip(30)
  31 muli 1 14 1    ; reg1 *= 14
  32 mulr 1 3 1     ; reg1 *= ip(32)
  33 addr 4 1 4     ; reg4 += reg1
  34 seti 0 6 0     ; reg0 = 0
  35 seti 0 9 3     ; ip = 0
#+END_SRC

* Équivalent

#+BEGIN_SRC python
  # init
  reg4 = (2 ** 2) * 19 * 11
  reg1 = (4 * 22) + 2
  reg4 += reg1
  if reg0 == 1:
	  reg1 = ((27 * 28) + 29) * 30 * 14 * 32
	  reg4 += reg1
	  reg0 = 0

  # double loop
  reg2 = 1
  1:
  reg5 = 1
  2:
  reg1 = reg2 * reg5
  if reg1 == reg4:
	  reg0 += reg2
  reg5 += 1
  if reg5 > reg4:
	  reg2 += 1
	  if reg2 > reg4:
		  return
	  else:
		  goto1
  else:
	  goto 2
#+END_SRC

#+BEGIN_SRC python
  # init
  reg4 = 926
  # reg4 = 10551326 # Part 2
  reg0 = 0

  # double loop
  reg2 = 1
  while reg2 <= reg4:
	  reg5 = 1
	  while reg5 <= reg4:
		  if reg2 * reg5 == reg4:
			  reg0 += reg2
		  reg5 += 1
	  reg2 += 1
#+END_SRC

* Final

#+BEGIN_SRC python
  # n = 926
  n = 10551326
  r = 0
  for i in range(1, n+1):
	  if n % i == 0:
		  r += i
  return r
#+END_SRC

#+RESULTS:
: 15826992
